// 1. კლასის შექმნა და ინიციალიზაცია**: შექმენი კლასი `User`, რომელსაც ექნება თვისებები `name` და `email`. კონსტრუქტორის მეშვეობით ინიციალიზაცია გაუკეთე ამ თვისებებს და შექმენი რამდენიმე `User` ობიექტი.

class User {
    constructor(name, email) {
        this.name = name;
        this.email = email;
    }
};

const user1 = new User("Luka", "luka123@gmail.com");
const user2 = new User("Anna", "anna123@mail.com");


// 2. მეთოდის შექმნა და გამოძახება: დაამატე `User` კლასს მეთოდი `displayInfo()`, რომელიც კონსოლში დაბეჭდავს მომხმარებლის სახელს და ელფოსტას. შექმენი რამდენიმე `User` ობიექტი და გამოძახე ეს მეთოდი თითოეულზე.


