// 1) გამოიყენეთ ჯერ REPL ფუნქცია node.js_ის და გატესტეთ რამდენიმე ბრძანების მუშაობა, შემდეგ შემქმენით app.js ფაილი გამოიყენეთ console ის მეთოდები log, assert, table ახსენით რას აკეთებს თიუთოეული, აგრეთვე დაბეჭდეთ გლობალური ობიექტი process და ახსენით თქვენი აზრით ეგ ობიექტი რა სახის ინფორმაციას ინახავს

// მეთოდები
// console.log() - გამოაქვს მესიჯი ტერმნინალში
// console.assert() - ბეჭდავს მესიჯს ტერმინალში თუ მნიშვნელობა მცდარია
// console.table() - გადაეცემა ობიექტი ან მასივი და ბეჭდავს მას ტერმინალში ცხრილის სახით

// process არის გლობალური ობიექტი, ის ინახავს გამოყენბად დამხმარე მეთოდებს და ინფორმაციას ამჟამინდელ კომპიუტერის პროცესსზე, სხვადასხვა პროგრამებზე რომლებიც ეშვებიან როგორც task manager-ში


// 2) გამოიყენეთ memoryUsage() მეთოდი და გამოთვალეთ რამდენი Megabyt დასჭირდა მეხსიერება თქვემს პროგრამას, შემდეგ გამოიყენეთ argv კუთვნილება იმისათვის რომ გაშვებისას გადასცეთ 3 რიცხვი და ეს 3 რიცხვი შეკრიბოთ

const usedMemory = process.memoryUsage().heapUsed;
const usedMegabytes = usedMemory / 1024 / 1024

console.log(`Used megabytes: ${usedMegabytes}`)

const args = process.argv.slice(2);
const numbers = args.map(Number);
const sum = numbers.reduce((a, b) => a + b, 0);

console.log(`Sum: ${sum}`);